# Задача: Расчет доходности облигации с учетом комиссии и налогов
# -----------------------------------------------------------------------------
# Введение:
# Облигация — это долговая ценная бумага, которая приносит доход в виде процентов
# (купонов) или разницы между ценой покупки и ценой погашения.
#
# Ваши вложения в облигацию могут быть уменьшены за счет:
# 1. Комиссии брокера при покупке облигации.
# 2. Подоходного налога (13%) на полученный доход.
#
# Ваша задача — написать программу, которая рассчитает ЧИСТУЮ доходность облигации
# с учетом этих факторов.
# -----------------------------------------------------------------------------
#
# Условия:
# Пользователь вводит данные:
# 1. Цена покупки облигации.
# 2. Цена погашения облигации.
# 3. Сумму разовой купонной выплаты.
# 4. Периодичность выплаты купонов (в месяцах).
# 5. Комиссию брокера (в процентах) — применяется только при покупке облигации.
# 6. Период до погашения облигации (в месяцах).
#
# Формулы:
# 1. Комиссия на покупку:
#    Комиссия на покупку = Цена покупки × (Комиссия / 100)
#
# 2. Полная цена покупки:
#    Полная цена покупки = Цена покупки + Комиссия на покупку
#
# 3. Общий купонный доход:
#    Общий купонный доход = Сумма купона × (Период до погашения / Периодичность купонов)
#
# 4. Общий доход до налогообложения:
#    Общий доход = Цена погашения + Общий купонный доход - Полная цена покупки
#
# 5. Налог на доход:
#    Налог = Общий доход × 13%, если доход > 0, иначе налог = 0
#
# 6. Чистая доходность (в процентах):
#    Чистая доходность (%) = (Общий доход - Налог) / Чистая цена покупки × 100
#
# -----------------------------------------------------------------------------
# Напишите программу ниже:
print("Введите цену покупки облигации (в рублях)")
buying_price=float(input())
print("Введите цену погашения облигации (в рублях)")
celling_price=float(input())
print("Введите сумму разовой купонной выплаты (в рублях)")
regular_payment=float(input())
print("Введите периодичность выплаты купонов (в месяцах)")
regularity=float(input())
print("Введите комиссию брокера (в процентах)")
comission=float(input())
print("Введите период до погашения облигации (в месяцах)")
months_left=float(input())
money_before_selling=months_left*regular_payment/regularity
total_money=money_before_selling+celling_price
PROFIT=total_money-buying_price-comission*buying_price/100
tax=max(0, 0.13*PROFIT)
print(PROFIT-tax)